lab11_php_ci/ci4/app/Controllers/Api/Auth.php

    public function login()
    {
        // 1. Ambil data dari form VueJS
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();

        // 2. Cari user berdasarkan username atau email
        $user = $model->where('username', $username)
                      ->orWhere('useremail', $username)
                      ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
OR `useremail` = 'admin'
 LIMIT 1